Revit 2027 API
UIView.Zoom Method
 Zoom the view.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Zoom(
	double zoomFactor
)
Public Sub Zoom (
	zoomFactor As Double
)
public:
void Zoom(
	double zoomFactor
)
member Zoom :
        zoomFactor : float -> unit
Parameters
zoomFactor Double
 Factor by which to zoom in or out. Values greater than 1 zooms in, less than 1 zooms out.
Exceptions
Exception | Condition
ArgumentException |  zoomFactor is not positive.
See Also
Reference
UIView Class
Autodesk.Revit.UI Namespace